class Datatext {
  static const String iftar_sehri_appbar_title = 'সেহরি ও ইফতারের দোয়া';
  static const String niot_title = '* সেহরির দোয়া (রোজার নিয়ত): ';
  static const String niot_arbi =
      'نَوَيْتُ اَنْ اُصُوْمَ غَدًا مِّنْ شَهْرِ رَمْضَانَ الْمُبَارَكِ فَرْضَا لَكَ يَا اللهُ فَتَقَبَّل مِنِّى اِنَّكَ اَنْتَ السَّمِيْعُ الْعَلِيْم ';
  static const String niot_spelling =
      'উচ্চারণ: নাওয়াইতু আন আছুম্মা গাদাম মিন শাহরি রমাজানাল মুবারাকি ফারদাল্লাকা, ইয়া আল্লাহু ফাতাকাব্বাল মিন্নি ইন্নিকা আনতাস সামিউল আলিম।';
  static const String niot_meaning =
      'অর্থ: হে আল্লাহ! আমি আগামীকাল পবিত্র রমজানের তোমার পক্ষ থেকে নির্ধারিত ফরজ রোজা রাখার ইচ্ছা পোষণ (নিয়্যত) করলাম। অতএব তুমি আমার পক্ষ থেকে (আমার রোযা তথা পানাহার থেকে বিরত থাকাকে) কবুল কর, নিশ্চয়ই তুমি সর্বশ্রোতা ও সর্বজ্ঞানী। ';

  static const String iftar_title = '* ইফতারের দোয়া:  ';
  static const String iftar_arbi =
      'اَللّٰهُمَّ لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ';
  static const String iftar_spelling =
      'উচ্চারণ: আল্লাহুম্মা লাকা ছুমতু ওয়া তাওয়াক্কালতু আ’লা রিজক্বিকা ওয়া আফতারতু বি রাহমাতিকা ইয়া আর্ হামার রা-হিমীন।';
  static const String iftar_meaning =
      'অর্থ: হে আল্লাহ! আমি তোমারই সন্তুষ্টির জন্য রোজা রেখেছি এবং তোমারই দেয়া রিযিক্ব দ্বারা ইফতার করছি।';
}
