class Datatext {
  //tasbih
  static const String iftar_sehri_appbar_title = 'সেহরি ও ইফতারের দোয়া';
  //niot and iftar
  static const String tasbih_page_target = 'টার্গেট সেট করুন ';
  static const String niot_title = '* সেহরির দোয়া (রোজার নিয়ত):';
  static const String niot_arbi =
      'نَوَيْتُ اَنْ اُصُوْمَ غَدًا مِّنْ شَهْرِ رَمْضَانَ الْمُبَارَكِ فَرْضَا لَكَ يَا اللهُ فَتَقَبَّل مِنِّى اِنَّكَ اَنْتَ السَّمِيْعُ الْعَلِيْم ';
  static const String niot_spelling =
      'উচ্চারণ: নাওয়াইতু আন আছুম্মা গাদাম মিন শাহরি রমাজানাল মুবারাকি ফারদাল্লাকা, ইয়া আল্লাহু ফাতাকাব্বাল মিন্নি ইন্নিকা আনতাস সামিউল আলিম।';
  static const String niot_meaning =
      'অর্থ: হে আল্লাহ! আমি আগামীকাল পবিত্র রমজানের তোমার পক্ষ থেকে নির্ধারিত ফরজ রোজা রাখার ইচ্ছা পোষণ (নিয়্যত) করলাম। অতএব তুমি আমার পক্ষ থেকে (আমার রোযা তথা পানাহার থেকে বিরত থাকাকে) কবুল কর, নিশ্চয়ই তুমি সর্বশ্রোতা ও সর্বজ্ঞানী। ';

  static const String iftar_title = '* ইফতারের দোয়া:  ';
  static const String iftar_arbi =
      'اَللّٰهُمَّ لَکَ صُمْتُ وَبِکَ اٰمَنْتُ وَعَلَيْکَ تَوَکَّلْتُ وَعَلٰی رِزْقِکَ اَفْطَرْتُ';
  static const String iftar_spelling =
      'উচ্চারণ: আল্লাহুম্মা লাকা ছুমতু ওয়া তাওয়াক্কালতু আ’লা রিজক্বিকা ওয়া আফতারতু বি রাহমাতিকা ইয়া আর্ হামার রা-হিমীন।';
  static const String iftar_meaning =
      'অর্থ: হে আল্লাহ! আমি তোমারই সন্তুষ্টির জন্য রোজা রেখেছি এবং তোমারই দেয়া রিযিক্ব দ্বারা ইফতার করছি।';

  //tarabih page
  static const String tarabih_salat_appbar_title = 'তারাবীহ সালাতের নিয়ম';
  static const String tarabih_description_title =
      '* তারাবীহ সম্পর্কে কিছু কথা:\n';
  static const String tarabih_description =
      'রমজান মাসের রাতের বিশেষ ইবাদত তারাবিহ নামাজ। তারাবিহ (تَرَاوِيْح) শব্দটি আরবি। এর অর্থ হলো বিশ্রাম করা। অর্থাৎ দীর্ঘ কেরাতে এ নামাজ পড়ার কারণে চার রাকাআত পরপর বিশ্রাম নিয়ে এ নামাজ পড়া হয় বিধায় এটিকে তারাবিহ নামকরণ করা হয়। তারাবিহ নামাজ রমজানেই আদায় করা হয়। \n\n\n দীর্ঘ ১১ মাস এ নামাজের চর্চা না থাকায় অনেকেই এ নামাজের নিয়ম প্রচলিত দোয়া ও মুনাজাতগুলো ভুলে যায়। যে কারণে রমজান এলেই তা স্মরণ করিয়ে দিতে আমাদের এ প্রচেষ্টা। দীর্ঘ কেরাতের এ নামাজ সম্পর্কে হাদিসে এসেছে-\n\n\n হজরত সাঈর ইবনে ইয়াযিদ রাদিয়াল্লাহু আনহু বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম রমজানের রাতের (তারাবিহতে) নামাজে শত শত (শ’-এর ওপর) আয়াত পড়তেন। ফলে সুদীর্ঘ সময় দাঁড়ানোর কারণে আমরা লাঠির ওপর ভর দিয়ে দাঁড়িয়ে থাকতাম। (মুয়াত্তা মুহাম্মদ) \n\n\n রমজানের রাতের বিশেষ ইবাদত তারাবিহ নামাজের রয়েছে তাৎপর্যপূর্ণ ফজিলত। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তারাবিহ নামাজের ফজিলত সম্পর্কে ঘোষণা করেছেন- \n\n\n ‘যে ব্যক্তি রমজানের রাতের (তারাবিহ) নামাজ ঈমানের সঙ্গে সাওয়াবের নিয়তে পড়বে, তার জীবনের আগের সব গোনাহ মাফ করে দেয়া হয়।’ সুবহানাল্লাহ!\n\n\n';
  //niom
  static const String tarabih_niom_title = '* তারাবিহ পড়ার নিয়ম:\n';
  static const String tarabih_niom_description =
      'দুই রাকাআত নামাজ আদায় করে সালাম ফিরিয়ে নামাজ শেষ করা। আবার দুই রাকাআত নামাজ পড়া। এভাবে ৪ রাকাআত আদায় করার পর একটু বিশ্রাম নেয়া। বিশ্রামের সময় তাসবিহ তাহলিল পড়া, দোয়া-দরূদ ও জিকির আজকার করা। তারপর আবার দুই দুই রাকাআত করে আলাদা আলাদা নিয়তে তারাবিহ আদায় করা। \n';

  //tarabih doa
  static const String tarabih_doa_title = '* তারাবিহ নামাজের দোয়া:\n';
  static const String tarabih_doa_description1 =
      'রাকাআত তারাবিহ আদায় করার পর ব্যাপক প্রচলিত একটি দোয়া রয়েছে। যা দেশের প্রায় মসজিদে পড়া হয়। আর তাহলো-\n';
  static const String tarabih_doa_arbi =
      'سُبْحانَ ذِي الْمُلْكِ وَالْمَلَكُوتِ سُبْحانَ ذِي الْعِزَّةِ وَالْعَظْمَةِ وَالْهَيْبَةِ وَالْقُدْرَةِ وَالْكِبْرِيَاءِ وَالْجَبَرُوْتِ سُبْحَانَ الْمَلِكِ الْحَيِّ الَّذِيْ لَا يَنَامُ وَلَا يَمُوْتُ اَبَدًا اَبَدَ سُبُّوْحٌ قُدُّوْسٌ رَبُّنا وَرَبُّ المْلائِكَةِ وَالرُّوْحِ\n\n';
  static const String tarabih_doa_spelling =
      'উচ্চারণ : ‘সুবহানা জিল মুলকি ওয়াল মালাকুতি, সুবহানা জিল ইয্যাতি ওয়াল আঝমাতি ওয়াল হায়বাতি ওয়াল কুদরাতি ওয়াল কিব্রিয়ায়ি ওয়াল ঝাবারুতি। সুবহানাল মালিকিল হাইয়্যিল্লাজি লা ইয়ানামু ওয়া লা ইয়ামুত আবাদান আবাদ; সুব্বুহুন কুদ্দুসুন রাব্বুনা ওয়া রাব্বুল মালায়িকাতি ওয়ার রূহ।’\n\n';
  static const String tarabih_doa_description2 =
      'উল্লেখ্য তারাবিহ নামাজের ৪ রাকাআত পর পর পড়ার এ দোয়াটি ব্যাপক প্রচলিত। তবে এ দোয়ার সঙ্গে তারাবিহ নামাজ হওয়া কিংবা না হওয়ার কোনো সম্পর্ক নেই। এমন নয় যে, এ দোয়া না জানলে তারাবিহ নামাজ আদায় হবে না। বরং যে কোনো দোয়াই পড়া যাবে। তবে এ সময়টিতে কুরআন-সুন্নাহর দোয়াগুলো পড়াই উত্তম।\n\n';

  //tarabih monajat
  static const String tarabih_monajat_title = '* তারাবিহ নামাজের মুনাজাত:\n';
  static const String tarabih_monajat_description =
      'অনেকেই ৪ রাকাআত পর পর মুনাজাত করে থাকে। আবার অনেকে পুরো নামাজ শেষ করে মুনাজাত করে থাকে। তবে নামাজ শেষ করে বিতর পড়ে মুনাজাত দেয়াই উত্তম। মুনাজাতের ক্ষেত্রেও একটি দোয়া ব্যাপকভাবে ব্যবহার হয়ে আসছে।এ মুনাজাতটিকেও অনেকে আবশ্যক মনে করে। কেউ কেউ এমনও মনে করে যে, এ দোয়াটি ছাড়া তারাবিহ নামাজের মুনাজাত হবে না।এটি মোটেও ঠিক নয়। তবে এ দোয়ায় মুনাজাত দিলে গোনাহ হবে তা নয়। মুনাজাতটি হলো-\n';
  static const String tarabih_monajat_arbi =
      'اَللَهُمَّ اِنَّا نَسْئَالُكَ الْجَنَّةَ وَ نَعُوْذُبِكَ مِنَ النَّارِ يَا خَالِقَ الْجَنَّةَ وَالنَّارِ- بِرَحْمَتِكَ يَاعَزِيْزُ يَا غَفَّارُ يَا كَرِيْمُ يَا سَتَّارُ يَا رَحِيْمُ يَاجَبَّارُ يَاخَالِقُ يَابَارُّ - اَللَّهُمَّ اَجِرْنَا مِنَ النَّارِ يَا مُجِيْرُ يَا مُجِيْرُ يَا مُجِيْرُ- بِرَحْمَتِكَ يَا اَرْحَمَ الرَّحِمِيْنَ';
  static const String tarabih_monajat_spelling =
      '\n\nউচ্চারণ : আল্লাহুম্মা ইন্না নাসআলুকাল জান্নাতা ওয়া নাউজুবিকা মিনাননার। ইয়া খালিক্বাল জান্নাতি ওয়ান নার। বিরাহমাতিকা ইয়া আঝিঝু ইয়া গাফফার, ইয়া কারিমু ইয়া সাত্তার, ইয়া রাহিমু ইয়া ঝাব্বার, ইয়া খালিকু ইয়া বার্রু। আল্লাহুম্মা আঝিরনা মিনান নার। ইয়া মুঝিরু, ইয়া মুঝিরু, ইয়া মুঝির। বিরাহমাতিকা ইয়া আরহামার রাহিমিন।’\n\n';

//roja vongo and makruh page

  static const String roja_vongo_appbar_title =
      'রোজা  ভঙ্গের কারণ এবং মাকরুহসমূহ';
  //roja vongo reason
  static const String roja_vongo_title = '* রোজা  ভঙ্গের কারণসমূহ :\n';

  static const String roja_vongo_reason1 =
      '(১) ইচ্ছাকৃত পানাহার করলে রোজা ভঙ্গ হয়ে যায়।\n';
  static const String roja_vongo_reason2 =
      '(২) ইচ্ছাকৃত বমি করলে সিয়াম ভঙ্গ হয়ে যায়।\n';
  static const String roja_vongo_reason3 =
      '(৩)রোজাদার সিয়াম অবস্থায় সহবাস করলে\n';
  static const String roja_vongo_reason4 =
      '(৪) পানাহারের কাজ করে এমন ইনজেকশন গ্রহণ করাতেও রোজা ভঙ্গ হবে।\n';
  static const String roja_vongo_reason5 = '(৫) মহিলাদের হায়েয বা নিফাস হলে।\n';
  static const String roja_vongo_reason6 =
      '(৬) মুখ খোলা রাখার কারণে বৃষ্টির পানি কণ্ঠনালীতে প্রবেশ করলে রোজা ভঙ্গ হয়ে যায়।\n';
  static const String roja_vongo_reason7 =
      '(৭) হস্তমৈথুন, আলিঙ্গন, অথবা চুম্বনের মাধ্যমে বির্যপাত ঘটালে রোজা ভঙ্গ হবে। তবে স্বপ্নদোষ বা রোগের কারণে বির্যপাত হলে রোজা ভঙ্গ হবে না।\n';
  static const String roja_vongo_reason8 =
      '(৮) দাঁতে আটকে থাকা ছোলা পরিমাণ বা তার চেয়ে বড় খাদ্যদ্রব্য গিলে ফেললে অথবা এর চেয়ে কম পরিমাণ মুখ থেকে বের করে পূণরায় গিলে ফেললে রোজা ভঙ্গ হয়ে যাবে।\n';
  static const String roja_vongo_reason9 =
      '(৯) দাঁতের মাড়ি থেকে রক্ত বের হয়ে তা কণ্ঠনালীতে পৌঁছালে এবং রক্তের স্বাদ অনুভূত হলে রোজা ভঙ্গ হয়ে যাবে।\n';
  static const String roja_vongo_reason10 =
      '(১০) সাহরি গ্রহণের সময় রয়েছে মনে করে পানাহার করলো, কিন্তু দেখা গেলো সুবহে সাদিক শেষ হয়ে গেল। সে রোজা হবে না।\n';
  static const String roja_vongo_reason11 =
      '(১১) কুলি করার সময় অসতর্কতার কারণে কণ্ঠনালীতে পানি প্রবেশ করলে রোজা ভঙ্গ হয়ে যায়।\n';

  //makruh
  static const String roja_makruh_title = '* রোজার মাকরূহসমূহ:\n';

  static const String roja_makruh_reason1 =
      '(১) গড়গড়া কুলি করা অথবা নাকে বেশি গভীরে পানি দেওয়া।\n';
  static const String roja_makruh_reason2 = '(২) অপ্রয়োজনে কোন জিনিস চিবানো।\n';
  static const String roja_makruh_reason3 =
      '(৩) তরকারি, তৈরিকৃত খাবার ইত্যাদির স্বাদ গ্রহণ করে ফেলে দেয়া। তবে কোন চাকরের মুনিব বা কোন নারীর স্বামী বদ মেজাজী হলে জিহ্বার অগ্রভাগ দিয়ে লবন চেখে তা ফেলে দেওয়ার অবকাশ আছে।\n';
  static const String roja_makruh_reason4 =
      '(৪) পরনিন্দা করা, মিথ্যা বলা, চোগলখুরী করা, অনর্থক কথাবার্তা বলা, নাটক-সিনেমা দেখা ও যেকোন গুনাহের কাজ করা।\n';
  static const String roja_makruh_reason5 =
      '(৫) গোসল ফরজ হয়েছে, এমন অবস্থায় নাপাক থেকে সারাদিন অতিবাহিত করা।\n';
  static const String roja_makruh_reason6 =
      '(৬) রোগী বা কোন পরীক্ষার জন্য শরীর দুর্বল হয়ে যায়, এমন পরিমাণ রক্ত দেওয়া।\n';
  static const String roja_makruh_reason7 =
      '(৭) রোজা অবস্থায় টুথপেস্ট-মাজন ব্যবহার করা মাকরুহ। কেননা তা কণ্ঠনালীতে প্রবেশ করলে রোজা ভেঙ্গে যায়।\n';
  static const String roja_makruh_reason8 =
      '(৮) রোজা অবস্থায় ঝগড়া করা, গালি-গালাজ করা।\n';
  static const String roja_makruh_reason9 =
      '(৯) মুখে অধিক পরিমাণ থুথু একত্রে গিলে ফেলা ।\n';
  static const String roja_makruh_reason10 =
      '(১০) দাঁতে ছোলা/বুটের চেয়ে ছোট কোন বস্তু আটকে থাকলে তা বের করে মুখের ভিতর থাকা অবস্থায় গিলে ফেলা।\n';
  static const String roja_makruh_reason11 =
      '(১১) নিজের উপর নিয়ন্ত্রণ থাকবে না এরূপ মনে হওয়া সত্ত্বেও স্ত্রীকে চুম্বন করা ও আলিঙ্গন করা। আর রোজা অবস্থায় স্ত্রীর ঠোঁট মুখে নেয়া সর্বাবস্থায় মাকরূহ।\n';
  static const String roja_makruh_reason12 =
      '(১২) নিজের মুখ দিয়ে চিবিয়ে কোন বস্তু শিশুর মুখে দেয়া। তবে অনন্যোপায় হয়ে করলে অসুবিধা নাই।\n';
  static const String roja_makruh_reason13 =
      '(১৩) ঠোটে লিপিস্টিক লাগালে যদি মুখের ভিতর চলে যাওয়ার আশঙ্কা থাকে তাহলে তা মাকরূহ।\n';

  //roja kajah aday er koronio and karon
  static const String roja_kajah_title =
      '* যেসব কারণে রোজা না রাখলে ক্ষতি নেই তবে কাজা আদায় করতে হবে:\n';
  static const String roja_kajah_reason1 = '(১) মুসাফির অবস্থায়।\n';
  static const String roja_kajah_reason2 =
      '(২) রোগ বৃদ্ধির বেশি আশঙ্কা থাকলে। \n';
  static const String roja_kajah_reason3 =
      '(৩) গর্ভের সন্তানের ক্ষতির আশঙ্কা থাকলে।\n';
  static const String roja_kajah_reason4 =
      '(৪) এমন তৃষ্ণা বা ক্ষুধা হয়, যাতে মৃত্যুর আশঙ্কা থাকতে পারে। \n';
  static const String roja_kajah_reason5 = '(৫) শক্তিহীন বৃদ্ধ হলে। \n';
  static const String roja_kajah_reason6 =
      '(৬) কোনো রোজাদারকে সাপে দংশন করলে।\n';
  static const String roja_kajah_reason7 =
      '(৭) মেয়েদের হায়েজ-নেফাসকালীন সময় রোজা ভঙ্গ করা যায়।\n';

  static const String roja_kajah_note =
      '*** আর যেসব কারণে রোজার কাজা ও কাফফারা দুটোই ওয়াজিব হয় তা হলো, জেনেশুনে স্ত্রীর সঙ্গে সহবাস করলে রোজা ভেঙে যাবে। এমতাবস্থায় কাজা ও কাফফারা দুটোই ওয়াজিব হয়। মনে রাখবেন, শরিয়তে কঠোর নিষেধ থাকা সত্ত্বেও বিনা কারণে রোজা ভঙ্গ করলে তার অবশ্যই কাজা-কাফফারা উভয়ই আদায় করা ওয়াজিব। যতটি রোজা ভঙ্গ হবে, ততটি রোজা আদায় করতে হবে। কাজা রোজা একটির পরিবর্তে একটি অর্থাৎ রোজার কাজা হিসেবে শুধু একটি রোজাই যথেষ্ট। কাফফারা আদায় করার তিনটি বিধান রয়েছে। ১. একটি রোজা ভঙ্গের জন্য একাধারে ৬০টি রোজা রাখতে হবে। কাফফারা ধারাবাহিকভাবে ৬০টি রোজাই রাখতে হবে, মাঝে কোনো একটি রোজা ভঙ্গ হলে আবার নতুন করে শুরু করতে হবে। ২. যদি কারও জন্য ৬০টি রোজা পালন সম্ভব না হয়, তাহলে সে ৬০ জন মিসকিনকে দুই বেলা খানা দেবে। অপর দিকে অসুস্থতাজনিত কারণে কারও রোজা রাখার ক্ষমতা না থাকলে ৬০ জন ফকির, মিসকিন, গরিব বা অসহায়কে প্রতিদিন দুই বেলা করে পেট ভরে খানা খাওয়াতে হবে। ৩. গোলাম বা দাসী আজাদ করে দিতে হবে। ***';
}
